In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import numpy as np

engine = create_engine('mysql+pymysql://root:root1234@localhost')

In [2]:
def get_query_result(query):
    with engine.connect() as connection:
        trans = connection.begin()
        try:
            if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
                query = text(query)
                result = pd.read_sql(query, connection)
                print("Query executed successfully and returned data.")
                return result
            else:
                query = text(query)
                result = connection.execute(query)
                trans.commit()  # Commit the transaction for non-select queries
                print("Query executed successfully")
                print("Rowcount:", result.rowcount)
                print("Returns Rows:", result.returns_rows)
                return result
        except Exception as e:
            trans.rollback()
            print(f"Query execution failed: {str(e)}")
            return None

In [3]:
query = """
show databases;
"""
get_query_result(query)

Query executed successfully and returned data.

             Database
0  information_schema
1          leadsource
2     leadsource_test
3               mysql
4  performance_schema
5        sql_practice
6                 sys
7        wordpress_db

In [4]:
query = """
use sql_practice;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [5]:
query = """
show tables;
"""
get_query_result(query)

Query executed successfully and returned data.

  Tables_in_sql_practice
0                  books

In [6]:
query = """
select * from books;
"""
get_query_result(query)

Query executed successfully and returned data.

,book_id,title,author_last_name,release_year,stock_quantity,pages,author_first_name
0,1,The Namesake,Lahiri,2003,32,291,Jhumpa
1,2,Norse Mythology,Gaiman,2016,43,304,Neil
2,3,American Gods,Gaiman,2001,12,465,Neil
3,4,Interpreter of Maladies,Lahiri,1996,97,198,Jhumpa
4,5,A Hologram for the King: A Novel,Eggers,2012,154,352,Dave
5,6,The Circle,Eggers,2013,26,504,Dave
6,7,The Amazing Adventures of Kavalier & Clay,Chabon,2000,68,634,Michael
7,8,Just Kids,Smith,2010,55,304,Patti
8,9,A Heartbreaking Work of Staggering Genius,Eggers,2001,104,437,Dave
9,10,Coraline,Gaiman,2003,100,208,Neil
10,11,What We Talk About When We Talk About Love: St...,Carver,1981,23,176,Raymond
11,12,Where I'm Calling From: Selected Stories,Carver,1989,12,526,Raymond
12,13,White Noise,DeLillo,1985,49,320,Don
13,14,Cannery Row,Steinbeck,1945,95,181,John
14,15,Oblivion: Stories,Foster Wallace,2004,172,329,David
15,16,Consider the Lobster,Foster Wallace,2005,92,343,David

### `UNIQUE`

The `UNIQUE` constraint in SQL is used to ensure that all values in a column or a group of columns are distinct across all rows in a table. It prevents duplicate values from being entered into the specified columns, thus maintaining data integrity.

### **Key Points About the `UNIQUE` Constraint**

1. **Single Column vs. Multiple Columns:**
   - **Single Column:** When applied to a single column, the `UNIQUE` constraint ensures that each value in that column is unique across all rows.
   - **Multiple Columns (Composite Unique Key):** When applied to a combination of columns, the `UNIQUE` constraint ensures that each combination of values across these columns is unique. However, individual columns in the combination can still contain duplicate values, as long as the combination is unique.

   **Example:**
   ```sql
   CREATE TABLE users (
       id INT PRIMARY KEY,
       email VARCHAR(255) UNIQUE
   );
   ```

   - In this example, the `email` column cannot contain duplicate values.

2. **NULL Values:**
   - In most database systems, the `UNIQUE` constraint allows multiple `NULL` values in a column because `NULL` is not considered equal to `NULL`. This means that if a column is `UNIQUE`, it can have multiple rows with `NULL` values, but all non-`NULL` values must be unique.
   - However, this behavior can vary slightly depending on the database system.

3. **Difference from `PRIMARY KEY`:**
   - **`PRIMARY KEY`:** A `PRIMARY KEY` is a combination of `UNIQUE` and `NOT NULL` constraints. This means that no column or set of columns defined as a `PRIMARY KEY` can contain `NULL` values or duplicates.
   - **`UNIQUE`:** Allows `NULL` values (in most systems) and can be applied to multiple columns or combinations of columns in the same table, unlike the `PRIMARY KEY`, which can only be defined once per table.

4. **Using `UNIQUE` on Multiple Columns:**
   - To create a unique constraint on multiple columns (a composite key), use the following syntax:

   ```sql
   CREATE TABLE orders (
       order_id INT,
       product_id INT,
       customer_id INT,
       UNIQUE (product_id, customer_id)
   );
   ```

   - This ensures that no two rows can have the same combination of `product_id` and `customer_id`.

5. **Adding `UNIQUE` Constraint to an Existing Table:**
   - If you need to add a `UNIQUE` constraint to an existing table, you can do so using the `ALTER TABLE` statement.

   **Example:**
   ```sql
   ALTER TABLE users
   ADD CONSTRAINT unique_email UNIQUE (email);
   ```

6. **Dropping a `UNIQUE` Constraint:**
   - To remove a `UNIQUE` constraint from a table, use the `ALTER TABLE` statement with the `DROP CONSTRAINT` option.

   **Example:**
   ```sql
   ALTER TABLE users
   DROP CONSTRAINT unique_email;
   ```

   - Note that the name of the constraint (e.g., `unique_email`) must be known to drop it.

### **Practical Example**

Consider a `users` table where you want to ensure that each user's email address is unique:

```sql
CREATE TABLE users (
    user_id INT PRIMARY KEY,
    username VARCHAR(50),
    email VARCHAR(255) UNIQUE
);
```

- **Explanation:** The `email` column is enforced to contain only unique values. Any attempt to insert a duplicate email address will result in an error.

### **Summary**

- **Single Column `UNIQUE`:** Ensures all values in a column are distinct.
- **Composite `UNIQUE`:** Ensures that combinations of values across multiple columns are unique.
- **NULL Values:** Multiple `NULL` values are typically allowed under a `UNIQUE` constraint.
- **Difference from `PRIMARY KEY`:** `UNIQUE` allows `NULL` values and can be applied to multiple columns, whereas `PRIMARY KEY` enforces uniqueness and non-nullability for a single set of columns.

The `UNIQUE` constraint is crucial for maintaining data integrity by preventing duplicate entries in your database tables.

## `CHECK`

The `CHECK` constraint in SQL is used to enforce a condition on the values that are allowed in a column or a set of columns. If the condition specified in the `CHECK` constraint evaluates to `TRUE` for a row, that row is allowed in the table. If the condition evaluates to `FALSE` or `NULL`, the row is not allowed to be inserted or updated.

### **Syntax**

```sql
CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    ...
    CHECK (condition)
);
```

### **Adding a `CHECK` Constraint to an Existing Table**

You can also add a `CHECK` constraint to an existing table using the `ALTER TABLE` statement.

```sql
ALTER TABLE table_name
ADD CONSTRAINT constraint_name CHECK (condition);
```

### **Examples**

1. **Basic `CHECK` Constraint**

   Suppose you have a `users` table and want to ensure that the `age` column only contains values between 18 and 100:

   ```sql
   CREATE TABLE users (
       user_id INT PRIMARY KEY,
       username VARCHAR(50),
       age INT,
       CHECK (age >= 18 AND age <= 100)
   );
   ```

   - **Explanation:** This `CHECK` constraint ensures that any `age` value must be between 18 and 100. If an attempt is made to insert or update a row with an `age` outside this range, the operation will fail.

2. **Using `CHECK` on Multiple Columns**

   You can also create a `CHECK` constraint that involves multiple columns. For example, to ensure that a `start_date` is always before an `end_date`:

   ```sql
   CREATE TABLE events (
       event_id INT PRIMARY KEY,
       event_name VARCHAR(100),
       start_date DATE,
       end_date DATE,
       CHECK (start_date < end_date)
   );
   ```

   - **Explanation:** This constraint ensures that the `start_date` is always earlier than the `end_date`. An attempt to insert or update rows where `start_date` is not less than `end_date` will fail.

3. **Adding a `CHECK` Constraint to an Existing Table**

   If you want to add a `CHECK` constraint to an existing column, use the `ALTER TABLE` statement:

   ```sql
   ALTER TABLE users
   ADD CONSTRAINT check_age CHECK (age >= 18 AND age <= 100);
   ```

   - **Explanation:** This adds a constraint named `check_age` to ensure that the `age` column only contains values between 18 and 100.

4. **Complex `CHECK` Conditions**

   You can use more complex expressions in a `CHECK` constraint. For instance, to ensure that the `salary` of an employee is at least twice their `bonus`:

   ```sql
   CREATE TABLE employees (
       employee_id INT PRIMARY KEY,
       salary DECIMAL(10, 2),
       bonus DECIMAL(10, 2),
       CHECK (salary >= 2 * bonus)
   );
   ```

   - **Explanation:** This constraint ensures that the `salary` is always at least twice the `bonus`.

### **Considerations**

- **Performance Impact:** `CHECK` constraints are evaluated whenever a row is inserted or updated. Complex conditions can have a performance impact, especially on large tables.
- **NULL Handling:** If a column involved in a `CHECK` constraint contains a `NULL` value, the `CHECK` constraint typically evaluates to `TRUE`, allowing the row. This is because SQL treats `NULL` as "unknown," not as a definite `FALSE`.
- **Database Support:** Most relational databases support `CHECK` constraints, but the implementation might differ slightly. Always check your specific database documentation for nuances.

### **Summary**

- **Purpose:** The `CHECK` constraint enforces specific rules on the data in a table, ensuring that it meets defined criteria.
- **Flexible Conditions:** You can create simple or complex conditions involving one or multiple columns.
- **Usage:** `CHECK` constraints are useful for enforcing business rules at the database level, such as ensuring valid ranges, relationships between columns, or custom conditions.

Using `CHECK` constraints effectively helps maintain data integrity by preventing invalid data from being stored in the database.

Constraints in SQL are rules applied to columns in a database table to enforce data integrity and ensure that the data adheres to certain rules. These constraints help maintain the accuracy and reliability of the data stored in the database by preventing invalid data from being entered into the tables.

### **Types of Constraints**

1. **PRIMARY KEY**
   - **Purpose:** Uniquely identifies each record in a table. A table can have only one `PRIMARY KEY`, which can consist of single or multiple columns (composite key).
   - **Characteristics:** 
     - Must contain unique values.
     - Cannot contain `NULL` values.
   - **Example:**
     ```sql
     CREATE TABLE users (
         user_id INT PRIMARY KEY,
         username VARCHAR(50)
     );
     ```

2. **UNIQUE**
   - **Purpose:** Ensures that all values in a column or a set of columns are unique across the table.
   - **Characteristics:** 
     - Allows `NULL` values, but the combination of columns defined in a `UNIQUE` constraint must be unique.
   - **Example:**
     ```sql
     CREATE TABLE users (
         email VARCHAR(255) UNIQUE
     );
     ```

3. **FOREIGN KEY**
   - **Purpose:** Enforces a link between two tables by ensuring that a column or set of columns in one table corresponds to the `PRIMARY KEY` in another table.
   - **Characteristics:** 
     - Maintains referential integrity between tables.
     - The `FOREIGN KEY` column values must match existing values in the referenced table or be `NULL`.
   - **Example:**
     ```sql
     CREATE TABLE orders (
         order_id INT PRIMARY KEY,
         user_id INT,
         FOREIGN KEY (user_id) REFERENCES users(user_id)
     );
     ```

4. **CHECK**
   - **Purpose:** Ensures that the values in a column meet a specific condition.
   - **Characteristics:** 
     - The `CHECK` constraint is used to limit the value range that can be placed in a column.
   - **Example:**
     ```sql
     CREATE TABLE employees (
         employee_id INT PRIMARY KEY,
         salary DECIMAL(10, 2),
         CHECK (salary > 0)
     );
     ```

5. **DEFAULT**
   - **Purpose:** Specifies a default value for a column if no value is provided when a new record is inserted.
   - **Characteristics:** 
     - Automatically assigns a value to the column if none is provided.
   - **Example:**
     ```sql
     CREATE TABLE products (
         product_id INT PRIMARY KEY,
         price DECIMAL(10, 2) DEFAULT 0.00
     );
     ```

6. **NOT NULL**
   - **Purpose:** Ensures that a column cannot have `NULL` values.
   - **Characteristics:** 
     - Every record must contain a value for this column.
   - **Example:**
     ```sql
     CREATE TABLE customers (
         customer_id INT PRIMARY KEY,
         name VARCHAR(100) NOT NULL
     );
     ```

7. **AUTO_INCREMENT (or SERIAL in PostgreSQL)**
   - **Purpose:** Automatically generates a unique number for a column, often used for `PRIMARY KEY` fields.
   - **Characteristics:** 
     - Each time a new row is inserted, the column's value automatically increments.
   - **Example (MySQL):**
     ```sql
     CREATE TABLE items (
         item_id INT AUTO_INCREMENT PRIMARY KEY,
         item_name VARCHAR(100)
     );
     ```

### **Applying Multiple Constraints**

You can apply multiple constraints to a single column to enforce several rules at once. For example, you can ensure that a column is `NOT NULL` and also has unique values:

```sql
CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    email VARCHAR(255) NOT NULL UNIQUE
);
```

### **Dropping Constraints**

Constraints can also be dropped if no longer needed. For example, to drop a `UNIQUE` constraint:

```sql
ALTER TABLE users
DROP CONSTRAINT unique_email;
```

Or to drop a `FOREIGN KEY`:

```sql
ALTER TABLE orders
DROP CONSTRAINT fk_user;
```

### **Summary**

- **PRIMARY KEY:** Unique identifier for table records; cannot be `NULL`.
- **UNIQUE:** Ensures unique values in specified columns.
- **FOREIGN KEY:** Links columns between tables to enforce referential integrity.
- **CHECK:** Ensures column values meet specific conditions.
- **DEFAULT:** Assigns a default value if no value is provided.
- **NOT NULL:** Prevents `NULL` values in the column.
- **AUTO_INCREMENT:** Automatically generates unique values for the column.

Constraints are fundamental to maintaining data integrity in relational databases, helping ensure that the data remains accurate, consistent, and reliable.

Enforcing a palindrome check directly in SQL using a `CHECK` constraint can be done, but it requires creating a custom SQL function (if your database supports it) because SQL itself doesn't have built-in functions for reversing strings or performing complex string manipulations.

Here's how you could achieve this in different SQL environments:

### **1. PostgreSQL**

PostgreSQL allows you to define custom functions that can be used in `CHECK` constraints.

#### **Step 1: Create a Function to Check for Palindromes**

```sql
CREATE OR REPLACE FUNCTION is_palindrome(text) RETURNS BOOLEAN AS $$
BEGIN
    RETURN $1 = REVERSE($1);
END;
$$ LANGUAGE plpgsql;
```

- **Explanation:** This function takes a string (`text`) as input and returns `TRUE` if the string is equal to its reverse.

#### **Step 2: Create a Table with a `CHECK` Constraint Using the Function**

```sql
CREATE TABLE words (
    id SERIAL PRIMARY KEY,
    word TEXT,
    CHECK (is_palindrome(word))
);
```

- **Explanation:** This `CHECK` constraint ensures that the `word` column only contains palindrome values by using the `is_palindrome` function.

#### **Example Inserts**

```sql
-- Valid insertion (Palindrome)
INSERT INTO words (word) VALUES ('radar');  -- Success

-- Invalid insertion (Not a Palindrome)
INSERT INTO words (word) VALUES ('hello');  -- Error: violates check constraint
```

### **2. SQL Server**

In SQL Server, you can achieve similar functionality using a computed column and a `CHECK` constraint, but creating a custom function directly in a `CHECK` constraint is not as straightforward.

#### **Alternative Approach: Use a Computed Column**

```sql
CREATE TABLE words (
    id INT PRIMARY KEY IDENTITY,
    word NVARCHAR(255),
    reversed_word AS REVERSE(word) PERSISTED,
    CHECK (word = reversed_word)
);
```

- **Explanation:** Here, a computed column `reversed_word` is created using the `REVERSE()` function, and then a `CHECK` constraint ensures that the original `word` is equal to its reverse.

#### **Example Inserts**

```sql
-- Valid insertion (Palindrome)
INSERT INTO words (word) VALUES ('radar');  -- Success

-- Invalid insertion (Not a Palindrome)
INSERT INTO words (word) VALUES ('hello');  -- Error: violates check constraint
```

### **3. MySQL**

MySQL does not support custom functions in `CHECK` constraints as of the latest versions, but you can still use a `TRIGGER` as an alternative method.

#### **Step 1: Create a Trigger to Enforce the Palindrome Check**

```sql
CREATE TRIGGER check_palindrome
BEFORE INSERT OR UPDATE ON words
FOR EACH ROW
BEGIN
    IF NEW.word <> REVERSE(NEW.word) THEN
        SIGNAL SQLSTATE '45000' 
        SET MESSAGE_TEXT = 'Value is not a palindrome';
    END IF;
END;
```

- **Explanation:** This trigger checks if the `word` being inserted or updated is a palindrome by comparing it to its reverse. If it is not, the trigger raises an error.

#### **Example Inserts**

```sql
-- Valid insertion (Palindrome)
INSERT INTO words (word) VALUES ('radar');  -- Success

-- Invalid insertion (Not a Palindrome)
INSERT INTO words (word) VALUES ('hello');  -- Error: Value is not a palindrome
```

### **Conclusion**

- **PostgreSQL**: Best for directly using a `CHECK` constraint with a custom function.
- **SQL Server**: Use computed columns with a `CHECK` constraint for similar functionality.
- **MySQL**: Use triggers as an alternative to enforce custom validation like palindrome checks.

Each database system has its own limitations and ways to handle this, so the implementation will vary based on the environment you're working in.

In [10]:
query = """
CREATE TABLE palindrome (
    word NVARCHAR(100),
    CONSTRAINT word_palindrome CHECK (word = REVERSE(word))
);

"""
get_query_result(query)

Query execution failed: (pymysql.err.OperationalError) (1050, "Table 'palindrome' already exists")
[SQL:
CREATE TABLE palindrome (
    word NVARCHAR(100),
    CONSTRAINT word_palindrome CHECK (word = REVERSE(word))
);

]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
query = """
insert into palindrome(word)
values
('momm');

"""
get_query_result(query)

Query execution failed: (pymysql.err.OperationalError) (3819, "Check constraint 'word_palindrome' is violated.")
[SQL:
insert into palindrome(word)
values
('momm');

]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [13]:
query = """
alter TABLE palindrome 
add word2 NVARCHAR(100) check(word2 = REVERSE(word2));

"""
get_query_result(query)

Query executed successfully
Rowcount: 1
Returns Rows: False

In [16]:
query = """
insert into palindrome(word2)
values
("mom");
"""
get_query_result(query)

Query executed successfully
Rowcount: 1
Returns Rows: False

In [18]:
query = """
select * from palindrome
"""
get_query_result(query)

Query executed successfully and returned data.

   word word2
0   mom  None
1  None   mom

The `ALTER` statement in SQL is used to modify the structure of an existing table. You can use the `ALTER` statement to add, delete, or modify columns in a table, as well as to add or drop constraints and indexes.

### **Common `ALTER TABLE` Operations**

#### 1. **Adding a New Column**

To add a new column to an existing table:

```sql
ALTER TABLE table_name
ADD column_name datatype;
```

- **Example:**
  ```sql
  ALTER TABLE employees
  ADD birthdate DATE;
  ```

#### 2. **Dropping a Column**

To remove a column from an existing table:

```sql
ALTER TABLE table_name
DROP COLUMN column_name;
```

- **Example:**
  ```sql
  ALTER TABLE employees
  DROP COLUMN birthdate;
  ```

#### 3. **Modifying an Existing Column**

You can change the data type of a column or alter other attributes like whether it can be `NULL`:

```sql
ALTER TABLE table_name
MODIFY column_name new_datatype;
```

- **Example:**
  ```sql
  ALTER TABLE employees
  MODIFY salary DECIMAL(10, 2);
  ```

  - **Note:** The `MODIFY` keyword is used in MySQL. In SQL Server, use `ALTER COLUMN` instead.

```sql
ALTER TABLE employees
ALTER COLUMN salary DECIMAL(10, 2);
```

#### 4. **Renaming a Column**

To rename a column in a table:

- **MySQL:**

  ```sql
  ALTER TABLE table_name
  CHANGE old_column_name new_column_name datatype;
  ```

- **SQL Server and PostgreSQL:**

  ```sql
  ALTER TABLE table_name
  RENAME COLUMN old_column_name TO new_column_name;
  ```

- **Example:**
  ```sql
  ALTER TABLE employees
  RENAME COLUMN birthdate TO date_of_birth;
  ```

#### 5. **Adding a Constraint**

You can add constraints like `UNIQUE`, `CHECK`, `FOREIGN KEY`, etc., to an existing column.

- **Adding a `UNIQUE` Constraint:**
  ```sql
  ALTER TABLE table_name
  ADD CONSTRAINT constraint_name UNIQUE (column_name);
  ```

  - **Example:**
    ```sql
    ALTER TABLE employees
    ADD CONSTRAINT unique_email UNIQUE (email);
    ```

- **Adding a `CHECK` Constraint:**
  ```sql
  ALTER TABLE table_name
  ADD CONSTRAINT constraint_name CHECK (condition);
  ```

  - **Example:**
    ```sql
    ALTER TABLE employees
    ADD CONSTRAINT check_salary CHECK (salary > 0);
    ```

- **Adding a `FOREIGN KEY` Constraint:**
  ```sql
  ALTER TABLE table_name
  ADD CONSTRAINT constraint_name FOREIGN KEY (column_name) REFERENCES other_table_name (other_column_name);
  ```

  - **Example:**
    ```sql
    ALTER TABLE orders
    ADD CONSTRAINT fk_user_id FOREIGN KEY (user_id) REFERENCES users (user_id);
    ```

#### 6. **Dropping a Constraint**

To remove a constraint from a table:

```sql
ALTER TABLE table_name
DROP CONSTRAINT constraint_name;
```

- **Example:**
  ```sql
  ALTER TABLE employees
  DROP CONSTRAINT unique_email;
  ```

- **MySQL Note:** In MySQL, the keyword `INDEX` is used when dropping an `UNIQUE` constraint:
  ```sql
  ALTER TABLE employees
  DROP INDEX unique_email;
  ```

#### 7. **Renaming a Table**

To rename an existing table:

- **SQL Server and PostgreSQL:**
  ```sql
  ALTER TABLE old_table_name
  RENAME TO new_table_name;
  ```

- **MySQL:**
  ```sql
  RENAME TABLE old_table_name TO new_table_name;
  ```

- **Example:**
  ```sql
  ALTER TABLE employees
  RENAME TO staff;
  ```

#### 8. **Changing Column Nullability**

To modify whether a column can contain `NULL` values:

```sql
ALTER TABLE table_name
ALTER COLUMN column_name SET NOT NULL;
```

- **Example:**
  ```sql
  ALTER TABLE employees
  ALTER COLUMN email SET NOT NULL;
  ```

- **MySQL:**
  ```sql
  ALTER TABLE employees
  MODIFY email VARCHAR(255) NOT NULL;
  ```

#### 9. **Changing Default Values**

To set or change the default value for a column:

```sql
ALTER TABLE table_name
ALTER COLUMN column_name SET DEFAULT default_value;
```

- **Example:**
  ```sql
  ALTER TABLE employees
  ALTER COLUMN salary SET DEFAULT 1000;
  ```

- **MySQL:**
  ```sql
  ALTER TABLE employees
  MODIFY salary DECIMAL(10, 2) DEFAULT 1000;
  ```

### **Summary**

- **`ALTER TABLE`** is used to modify the structure of an existing table.
- You can add, drop, or modify columns, rename columns or tables, and add or drop constraints.
- Different SQL databases (like MySQL, SQL Server, and PostgreSQL) may have slightly different syntax for these operations, so it's important to consult your specific database documentation when performing these tasks.

These operations allow you to adapt your database schema to evolving application requirements without losing existing data.